{
  "@type": "Interface",
  "@id": "dtmi:jacdac:services:x1e4b7e66;1",
  "displayName": "Role Manager",
  "description": "Assign roles to services on the Jacdac bus.\n\nInternally, the role manager stores a mapping from from `(device_id, service_idx)` to role name.\nUsers refer to services by using role names (eg., they instantiate an accelerometer client with a given role name).\nEach client has a role, and roles are unique to clients\n(ie., one should not have both a gyro and accelerometer service with role `left_leg`).\n\nRole names can be hierarchical, using slash character as a separator.\nExamples: `left_leg/acc`, `left_leg/gyro`, `right_leg/acc`.\nIf two roles share the prefix before first slash, it should be used as a hint that the services\nshould be co-located on a single device\n(eg., here the `left_leg` \"location\" is expected to have both an accelerometer and a gyro service on a single device).",
  "contents": [
    {
      "@type": "Property",
      "name": "auto_bind",
      "@id": "dtmi:jacdac:x1e4b7e66:rw:autobind;1",
      "description": "Normally, if some roles are unfilled, and there are idle services that can fulfill them,\nthe brain device will assign roles (bind) automatically.\nSuch automatic assignment happens every second or so, and is trying to be smart about \nco-locating roles that share \"host\" (part before first slash),\nas well as reasonably stable assignments.\nOnce user start assigning roles manually using this service, auto-binding should be disabled to avoid confusion.",
      "schema": "boolean",
      "writable": true
    },
    {
      "@type": "Telemetry",
      "name": "all_roles_allocated",
      "@id": "dtmi:jacdac:x1e4b7e66:ro:allrolesallocated;1",
      "description": "Indicates if all required roles have been allocated to devices.",
      "schema": "boolean"
    },
    {
      "@type": [
        "Telemetry",
        "Event"
      ],
      "name": "change",
      "@id": "dtmi:jacdac:x1e4b7e66:event:change;1",
      "description": "Emit notifying that the internal state of the service changed.",
      "schema": "dtmi:jacdac:x1e4b7e66:event;1"
    }
  ],
  "extends": [
    "dtmi:jacdac:services:x1ffffff3;1"
  ],
  "schemas": [
    {
      "@id": "dtmi:jacdac:x1e4b7e66:event;1",
      "@type": "Object",
      "fields": [
        {
          "name": "count",
          "schema": "integer"
        }
      ]
    }
  ],
  "@context": "dtmi:dtdl:context;2"
}